PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_ethif.c
/***************************************************************************//**
* \file cy_ethif.c
* \version 1.30
*
* Provides an API implementation of the ETHIF driver
*
********************************************************************************
* \copyright
* Copyright 2021-2024 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXETH)

#include "cy_ethif.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "cdn_errno.h"
#include "cedi.h"
#include "edd_int.h"
#include "cy_syspm.h"

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 18.1', 42, 'Overrunning array expected.')
CY_MISRA_DEVIATE_BLOCK_START('OVERRUN', 43, 'Overrunning array expected.')


/***************************************
*       Local Variables
***************************************/
/** Cadence driver instantiation    */
static CEDI_OBJ *cyp_ethif_gemgxlobj;

/** Ethernet configurations */
static CEDI_Config  cy_ethif_cfg[CY_ETH_DEFINE_NUM_IP];

/** Cadence driver memory requirements */
static CEDI_SysReq  cy_ethif_sysreq;

/** Private data structures required for each instance of Ethernet IPs  */
static CEDI_PrivateData *cyp_ethif_pd[CY_ETH_DEFINE_NUM_IP];

/** Variables holding Statistics register values    */
static CEDI_Statistics   *cyp_ethif_statistic[CY_ETH_DEFINE_NUM_IP];

/** Private data memory allocation  */
static uint8_t cy_ethif_privatedata[CY_ETH_DEFINE_NUM_IP][1800] = {{0,},};

/** Tx descriptors */
/** CY_ETH_DEFINE_NUM_TXQS * CY_ETH_DEFINE_NUM_IP to avoid race condition in hardware; each BD list for particular queue must have 1 more BD */
CY_SECTION_SHAREDMEM
CY_ALIGN(32) static uint8_t cy_ethif_tx_desc_list[CY_ETH_DEFINE_NUM_IP][CY_ETH_DEFINE_NUM_TXQS][CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE + 1][CY_ETH_BD_SIZE] = {{{{0,},},},};

/** Rx descriptors */
/** Cadence driver requires another set of buffers to replace the existing
* buffers after a frame has been received. so, number of required BDs would not
* be same as number of buffers */
CY_SECTION_SHAREDMEM
CY_ALIGN(32) static uint8_t cy_ethif_rx_desc_list[CY_ETH_DEFINE_NUM_IP][CY_ETH_DEFINE_NUM_RXQS][((CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE + 1) * 2)][CY_ETH_BD_SIZE] = {{{{0,},},},};

/** Statistics registers    */
static uint8_t cy_ethif_statistic[CY_ETH_DEFINE_NUM_IP][160] = {{0,},};

static cy_stc_ethif_cb_t stccallbackfunctions[CY_ETH_DEFINE_NUM_IP] = {{NULL, NULL, NULL, NULL, NULL},};
static cy_stc_ethif_queue_disablestatus_t stcQueueDisStatus[CY_ETH_DEFINE_NUM_IP] = {{{0,}, {0,}},};
CY_SECTION_SHAREDMEM
CY_ALIGN(32) static volatile uint8_t g_tx_bdcount[CY_ETH_DEFINE_NUM_IP] = {0,};

/* Deep sleep */
typedef struct
{
    uint8_t copy_all_frames;
    uint8_t no_broadcast;
    cy_stc_ethif_filter_config_t fileter1Config;
    uint16_t *ptrRxBufs[CY_ETH_DEFINE_NUM_RXQS];

} cy_stc_ethif_dsreg_t;

static cy_stc_ethif_dsreg_t g_ds_regs[CY_ETH_DEFINE_NUM_IP];

static cy_stc_syspm_callback_params_t g_ds_params[CY_ETH_DEFINE_NUM_IP];
static cy_stc_syspm_callback_t g_ds_cbHandler[CY_ETH_DEFINE_NUM_IP];
static cy_ethif_buffpool_t *g_pRxQbuffPool[CY_ETH_DEFINE_NUM_IP][CY_ETH_DEFINE_NUM_RXQS];

/*****************************************************************************
* Local function prototypes ('static')
*****************************************************************************/
static void Cy_ETHIF_EnableInterrupts(uint8_t u8EthIfInstance, cy_stc_ethif_intr_config_t * pstcInterruptList);
static void Cy_ETHIF_PrepareConfiguration(uint8_t u8EthIfInstance, cy_stc_ethif_mac_config_t * pstcEthIfConfig);
static void Cy_ETHIF_AssignMemory(uint8_t u8EthIfInstance);
static uint8_t Cy_ETHIF_GetEthIfInstance(void *pcy_privatedata);
static void Cy_ETHIF_EventTx(void *pcy_privatedata, uint32_t u32event, uint8_t u8qnum);
static void Cy_ETHIF_EventTxError(void *pcy_privatedata, uint32_t u32event, uint8_t u8qnum);
static void Cy_ETHIF_EventRxFrame(void *pcy_privatedata, uint8_t u8qnum);
static void Cy_ETHIF_EventRxError(void *pcy_privatedata, uint32_t a_event, uint8_t a_qnum);
static void Cy_ETHIF_EventPhyManComplete(void *pcy_privatedata, uint8_t u8read, uint16_t u16ReadData);
static void Cy_ETHIF_EventhrespError(void *pcy_privatedata, uint8_t u8qnum);
static void Cy_ETHIF_EventLpPageRx(void* pcy_privatedata, struct CEDI_LpPageRx* pageRx);
static void Cy_ETHIF_EventAn(void* pcy_privatedata, struct CEDI_NetAnStatus* netStat);
static void Cy_ETHIF_EventLinkChange(void *pcy_privatedata, uint8_t a_linkstate);
static void Cy_ETHIF_EventTsu(void *pcy_privatedata, uint32_t u32event);
static void Cy_ETHIF_EventPauseFrame(void *pcy_privatedata, uint32_t u32event);
static void Cy_ETHIF_EventPtp(void* pcy_privatedata, uint32_t u32type, struct CEDI_1588TimerVal* time);
static void Cy_ETHIF_EventExternalInt(void * pcy_privatedata);
static void Cy_ETHIF_EventWol(void * pcy_privatedata);
static void Cy_ETHIF_EventLpi(void * pcy_privatedata);
static void Cy_ETHIF_InitializeBuffers(void);
static cy_en_ethif_status_t Cy_ETHIF_WrapperConfig(uint8_t u8EthIfInstance, cy_stc_ethif_wrapper_config_t * pstcWrapperConfig);
static void Cy_ETHIF_IPEnable(ETH_Type *base);
static void Cy_ETHIF_IPDisable(ETH_Type *base);
static cy_en_ethif_status_t Cy_ETHIF_TSUInit(uint8_t u8EthIfInstance, cy_stc_ethif_tsu_config_t * pstcTSUConfig);
static cy_en_ethif_status_t Cy_ETHIF_DisableQueues(ETH_Type *base, cy_stc_ethif_mac_config_t * pstcEthIfConfig);
static cy_en_syspm_status_t Cy_ETHIF_DSCallbackFunc(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);
/*****************************************************************************
* Local Call back function supplied to Cadence driver
*****************************************************************************/
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 8.4', 1, 'Intentional definition')
CEDI_Callbacks Cy_ETHIF_Callbacks =
{
    .phyManComplete = (CEDI_CbPhyManComplete)Cy_ETHIF_EventPhyManComplete,
    .txEvent        = (CEDI_CbTxEvent)Cy_ETHIF_EventTx,
    .txError        = (CEDI_CbTxError)Cy_ETHIF_EventTxError,
    .rxFrame        = (CEDI_CbRxFrame)Cy_ETHIF_EventRxFrame,
    .rxError        = (CEDI_CbRxError)Cy_ETHIF_EventRxError,
    .hrespError     = (CEDI_CbHrespError)Cy_ETHIF_EventhrespError,
    .lpPageRx       = (CEDI_CbLpPageRx)Cy_ETHIF_EventLpPageRx,
    .anComplete     = (CEDI_CbAnComplete)Cy_ETHIF_EventAn,
    .linkChange     = (CEDI_CbLinkChange)Cy_ETHIF_EventLinkChange,
    .tsuEvent       = (CEDI_CbTsuEvent)Cy_ETHIF_EventTsu,
    .pauseEvent     = (CEDI_CbPauseEvent)Cy_ETHIF_EventPauseFrame,
    .ptpPriFrameTx  = (CEDI_CbPtpPriFrameTx)Cy_ETHIF_EventPtp,
    .ptpPeerFrameTx = (CEDI_CbPtpPeerFrameTx)Cy_ETHIF_EventPtp,
    .ptpPriFrameRx  = (CEDI_CbPtpPriFrameRx)Cy_ETHIF_EventPtp,
    .ptpPeerFrameRx = (CEDI_CbPtpPeerFrameRx)Cy_ETHIF_EventPtp,
    .lpiStatus      = (CEDI_CbLpiStatus)Cy_ETHIF_EventLpi,
    .wolEvent       = (CEDI_CbWolEvent)Cy_ETHIF_EventWol,
    .extInpIntr     = (CEDI_CbExtInpIntr)Cy_ETHIF_EventExternalInt
};
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 8.4')

