PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_ethif.c
    /** Clear configuration table   */
    (void)memset((void *)&cy_ethif_cfg[u8EthIfInstance], 0, sizeof(cy_ethif_cfg[u8EthIfInstance]));

    /** Load GEM_GXL register base address  */
    cy_ethif_cfg[u8EthIfInstance].regBase = CY_ETHIF_GEMGXL_ADDR_REGBASE(u8EthIfInstance);
    //(u8EthIfInstance == CY_ETHIF_INSTANCE_0) ? CY_ETH0_GEMGXL_ADDR_REGBASE : CY_ETH1_GEMGXL_ADDR_REGBASE;

    /** Prepare Queues  */
    cy_ethif_cfg[u8EthIfInstance].rxQs = CY_ETH_DEFINE_NUM_RXQS;
    cy_ethif_cfg[u8EthIfInstance].txQs = CY_ETH_DEFINE_NUM_TXQS;

    for (u8QueueCounter = 0; u8QueueCounter < cy_ethif_cfg[u8EthIfInstance].rxQs; u8QueueCounter++)
    {
        cy_ethif_cfg[u8EthIfInstance].rxQLen[u8QueueCounter] = CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE;
    }

    for (u8QueueCounter = 0; u8QueueCounter < cy_ethif_cfg[u8EthIfInstance].txQs; u8QueueCounter++)
    {
        cy_ethif_cfg[u8EthIfInstance].txQLen[u8QueueCounter] = CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE;
    }

    /** Prepare Network control Register    */
    cy_ethif_cfg[u8EthIfInstance].pfcMultiQuantum    = 0;                                       /* bit25    pfc_ctrl              */
    cy_ethif_cfg[u8EthIfInstance].enExtTsuPort       = 0;                                       /* bit23    ext_tsu_port_enable, Not supported by hardware  */
    cy_ethif_cfg[u8EthIfInstance].storeUdpTcpOffset  = 0;                                       /* bit22    store_udp_offset      */
    cy_ethif_cfg[u8EthIfInstance].altSgmiiEn         = 0;                                       /* bit21    alt_sgmii_mode, Not supported by hardware       */
    cy_ethif_cfg[u8EthIfInstance].enableMdio         = 0;                                       /* bit4     man_port_en, Bit is separately enabled during MDIO operation  */

    /** Prepare Network Configuration Register    */
    cy_ethif_cfg[u8EthIfInstance].uniDirEnable       = 0;                                       /* bit31    uni_direction_enable, Not supported by hardware    */
    cy_ethif_cfg[u8EthIfInstance].ignoreIpgRxEr      = 0;                                       /* bit30    ignore_ipg_rx_er, Not supported by hardware        */
    cy_ethif_cfg[u8EthIfInstance].enRxBadPreamble    = pstcEthIfConfig->u8enRxBadPreamble;      /* bit29    nsp_change           */
    // cy_ethif_cfg[u8EthIfInstance].ifTypeSel          = pstcEthIfConfig->ifTypeSel;              /* bit27    sgmii_mode_enable  (reserved)  */
    /*          (see the following)  */
    // don't care                                                                               /* bit26    ignore_rx_fcs        */
    cy_ethif_cfg[u8EthIfInstance].enRxHalfDupTx      = 0;                                       /* bit25    en_half_duplex_rx, not supported by hardware    */
    cy_ethif_cfg[u8EthIfInstance].chkSumOffEn        = pstcEthIfConfig->u8chkSumOffEn;          /* bit24    receive_checksum_offload_enable */
    cy_ethif_cfg[u8EthIfInstance].disCopyPause       = pstcEthIfConfig->u8disCopyPause;         /* bit23    disable_copy_of_pause_frames */
#if defined(ETH_AXI_MASTER_PRESENT) && (ETH_AXI_MASTER_PRESENT == 1U)
    cy_ethif_cfg[u8EthIfInstance].dmaBusWidth    = CEDI_DMA_BUS_WIDTH_64;                   /* bit22:21 data bus with        */
#else
    cy_ethif_cfg[u8EthIfInstance].dmaBusWidth    = CEDI_DMA_BUS_WIDTH_32;                   /* bit22:21 data bus with        */
#endif
    /* 00:32bit 01:64bit    */
    cy_ethif_cfg[u8EthIfInstance].mdcPclkDiv         = (CEDI_MdcClkDiv)pstcEthIfConfig->mdcPclkDiv;             /* bit20:18 mdc_clock_division   */
    /*          010: Divide 32       */
    /*          011: Divide 48       */
    // don't care                                                                               /* bit17    fcs_remove           */
    cy_ethif_cfg[u8EthIfInstance].rxLenErrDisc       = pstcEthIfConfig->u8rxLenErrDisc;         /* bit16    length_field_error_frame_discard */
    cy_ethif_cfg[u8EthIfInstance].rxBufOffset        = 0;                                       /* bit15:14 receive_buffer_offset */
    // don't care                                                                               /* bit13    pause_enable         */
    // don't care                                                                               /* bit12    retry_test           */
    //cy_ethif_cfg[u8EthIfInstance].ifTypeSel        = pstcEthIfConfig->ifTypeSel               /* bit11    pcs_select (reserved)*/
    /*          (see the following)  */
    //cy_ethif_cfg[u8EthIfInstance].ifTypeSel        = pstcEthIfConfig->ifTypeSel               /* bit10    gigabit_mode_enable  */
    /*          (see the following)  */
    cy_ethif_cfg[u8EthIfInstance].extAddrMatch       = 0;                                       /* bit9     external_address_match_enable, not supported by hardware */
    cy_ethif_cfg[u8EthIfInstance].rx1536ByteEn       = pstcEthIfConfig->u8rx1536ByteEn;         /* bit8     receive_1536_byte_frames */
    // don't care                                                                               /* bit7     unicast_hash_enable  */
    // don't care                                                                               /* bit6     multicast_hash_enable  */
    // don't care                                                                               /* bit5     no_broadcast         */
    // don't care                                                                               /* bit4     copy_all_frames      */
    cy_ethif_cfg[u8EthIfInstance].rxJumboFrEn        = pstcEthIfConfig->u8rxJumboFrEn;          /* bit3     jumbo_frames         */
    // don't care                                                                               /* bit2     discard_non_vlan_frames */
    cy_ethif_cfg[u8EthIfInstance].fullDuplex         = 1;                                       /* bit1     full_duplex          */
    //cy_ethif_cfg[u8EthIfInstance].ifTypeSel        = pstcEthIfConfig->ifTypeSel               /* bit0     speed                */

    /** configuration for cy_ethif_cfg[u8EthIfInstance].ifTypeSel    */
    if ((pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_MII_10) ||
            (pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RGMII_10) ||
            (pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RMII_10))
    {
        cy_ethif_cfg[u8EthIfInstance].ifTypeSel = CEDI_IFSP_10M_MII;
    }
    else if ((pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_MII_100) ||
             (pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RMII_100) ||
             (pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RGMII_100))
    {
        cy_ethif_cfg[u8EthIfInstance].ifTypeSel = CEDI_IFSP_100M_MII;
    }
    else
    {
        if ((pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_GMII_1000) ||
                (pstcEthIfConfig->pstcWrapperConfig->stcInterfaceSel == CY_ETHIF_CTL_RGMII_1000))
        {
            cy_ethif_cfg[u8EthIfInstance].ifTypeSel = CEDI_IFSP_1000M_GMII;
        }
        else
        {
            /* */
        }
    }

