PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_ethif.c
    /* Timer increment register to achieve 1 second as precise as possible */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Intentional typecast of pstcTSUConfig->pstcTimerIncValue to CEDI_TimerIncrement* struct type.');
    if (((uint32_t)EOK) != cyp_ethif_gemgxlobj->set1588TimerInc((void *)cyp_ethif_pd[u8EthIfInstance], (CEDI_TimerIncrement *)pstcTSUConfig->pstcTimerIncValue))
    {
        /* Reason could be Null pointer, hardware does not support TSU */
        return CY_ETHIF_BAD_PARAM;
    }

    /* one step sync enabled    */
    if (((uint32_t)EOK) != cyp_ethif_gemgxlobj->set1588OneStepTxSyncEnable((void *)cyp_ethif_pd[u8EthIfInstance], (uint8_t) pstcTSUConfig->bOneStepTxSyncEnable))
    {
        /* Reason could be Null pointer, hardware does not support TSU or bOneStepTxSyncEnable > 1 */
        return CY_ETHIF_BAD_PARAM;
    }

    /* Set the descriptor time stamp Mode */
    if (((uint32_t)EOK) != cyp_ethif_gemgxlobj->setDescTimeStampMode((void *)cyp_ethif_pd[u8EthIfInstance],
            (CEDI_TxTsMode)pstcTSUConfig->enTxDescStoreTimeStamp, (CEDI_RxTsMode)pstcTSUConfig->enRxDescStoreTimeStamp))
    {
        /** Reason could be Null pointer, hardware does not support TSU, enTxDescStoreTimeStamp > CEDI_TX_TS_ALL, enRxDescStoreTimeStamp > CEDI_RX_TS_ALL  */
        return CY_ETHIF_BAD_PARAM;
    }

    /* disabled storing nanosecond in CRC field of received frame */
    if (((uint32_t)EOK) != cyp_ethif_gemgxlobj->setStoreRxTimeStamp((void *)cyp_ethif_pd[u8EthIfInstance], (uint8_t) pstcTSUConfig->bStoreNSinRxDesc))
    {
        /* Reason could be Null pointer, hardware does not support TSU or bStoreNSinRxDesc > 1 */
        return CY_ETHIF_BAD_PARAM;
    }

    return CY_ETHIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_InitializeBuffers
****************************************************************************//**
*
* \brief Function initializes the buffer status and clears the memory with
*        CY_EHTIF_EMPTYVALUE value.
*
* \param none
*
*******************************************************************************/
static void Cy_ETHIF_InitializeBuffers(void)
{
    for (uint32_t index = 0; index < CY_ETH_DEFINE_NUM_IP; index++)
    {
        g_tx_bdcount[index] = 0;
    }
}


/*******************************************************************************
* Function Name: Cy_ETHIF_GetEthIfInstance
****************************************************************************//**
*
* \brief To derive the instance number.
*
* \param pcy_privatedata     Instance specific private data
* \return Ethernet instance (ETH0=0 or ETH1=1)
*
*******************************************************************************/
static uint8_t Cy_ETHIF_GetEthIfInstance(void *pcy_privatedata)
{
    uint8_t u8EthIfInstance = 0U;

    if (pcy_privatedata == cyp_ethif_pd[0])
    {
        u8EthIfInstance = CY_ETHIF_INSTANCE_0;
    }
    else
    {
#if defined(CY_IP_MXETH_INSTANCES) && (CY_IP_MXETH_INSTANCES > 1u)
        if (pcy_privatedata == cyp_ethif_pd[1])
        {
            u8EthIfInstance = CY_ETHIF_INSTANCE_1;
        }
        else
        {
            CY_ASSERT(0UL);
        }
#else
        CY_ASSERT(0UL);
#endif
    }
    return u8EthIfInstance;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventTx
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Tx Event
*
* \param pcy_privatedata    Instance specific private data
* \param u32event occurred event
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventTx(void *pcy_privatedata, uint32_t u32event, uint8_t u8qnum)
{
    CEDI_TxDescData Tx_DescData;
    ETH_Type *base;
    uint8_t u8EthIfInstance;

    /** derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);

    if (0UL != (u32event & ((uint32_t)CEDI_EV_TX_COMPLETE)))
    {
        (void)cyp_ethif_gemgxlobj->freeTxDesc((void *)cyp_ethif_pd[u8EthIfInstance], u8qnum, &Tx_DescData);

        g_tx_bdcount[u8EthIfInstance]--;

        /* application callback function */
        if (stccallbackfunctions[u8EthIfInstance].txcompletecb != NULL)
        {
            stccallbackfunctions[u8EthIfInstance].txcompletecb(base, u8qnum);
        }

    }

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventTxError
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Tx Error Event
*
* \param pcy_privatedata    Instance specific private data
* \param u32event occurred event
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventTxError(void *pcy_privatedata, uint32_t u32event, uint8_t u8qnum)
{
    CEDI_TxDescData Tx_DescData;
    uint8_t u8EthIfInstance;
    ETH_Type *base;

    /** derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);

    (void)cyp_ethif_gemgxlobj->freeTxDesc((void *)cyp_ethif_pd[u8EthIfInstance], u8qnum, &Tx_DescData);

    /** application callback function */
    if (stccallbackfunctions[u8EthIfInstance].txerrorcb != NULL)
    {
        stccallbackfunctions[u8EthIfInstance].txerrorcb(base, u8qnum);
    }

    g_tx_bdcount[u8EthIfInstance]--;

    CY_UNUSED_PARAMETER(u32event); /* Suppress a compiler warning about unused variables */

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventRxFrame
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Rx Event
*
* \param pcy_privatedata    Instance specific private data
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventRxFrame(void *pcy_privatedata, uint8_t u8qnum)
{
    uint32_t        u32RxNum;
    CEDI_BuffAddr   tmpBufAddr;
    CEDI_RxDescData Rx_DescData;
    CEDI_RxDescStat Rx_DescStat;
    uint8_t u8EthIfInstance = 255;
    ETH_Type *base;
    uint32_t bufLen;
    bool noData = false;
    uint8_t *rxBufAddr;

    /* derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);
    /* number of used buffers */
    u32RxNum = cyp_ethif_gemgxlobj->numRxUsed((void *)cyp_ethif_pd[u8EthIfInstance], u8qnum);

    /** read receive queue */
    while (0UL != u32RxNum)
    {
        tmpBufAddr.pAddr = 0;
        tmpBufAddr.vAddr = tmpBufAddr.pAddr;
        bufLen = 0;
        if (stccallbackfunctions[u8EthIfInstance].rxgetbuff != NULL)
        {
            stccallbackfunctions[u8EthIfInstance].rxgetbuff(base, (uint8_t**)&rxBufAddr, &bufLen);
            tmpBufAddr.pAddr = (uintptr_t)rxBufAddr;
            tmpBufAddr.vAddr = tmpBufAddr.pAddr;
        }

        (void)cyp_ethif_gemgxlobj->readRxBuf((void *)cyp_ethif_pd[u8EthIfInstance],
                                             u8qnum,
                                             &tmpBufAddr,
                                             CY_ETHIF_BUFFER_CLEARED_0,
                                             &Rx_DescData);

        switch ((CEDI_RxRdStat)Rx_DescData.status)
        {
        case CEDI_RXDATA_SOF_EOF:     // 0
            /* receive start and end frame */
            cyp_ethif_gemgxlobj->getRxDescStat((void *)cyp_ethif_pd[u8EthIfInstance],
                                               Rx_DescData.rxDescStat,
                                               &Rx_DescStat);

