PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_ethif.c
            /* application callback function */
            if (stccallbackfunctions[u8EthIfInstance].rxframecb != NULL)
            {
                stccallbackfunctions[u8EthIfInstance].rxframecb(base, (uint8_t*)tmpBufAddr.pAddr, Rx_DescStat.bufLen);
            }
            break;
        case CEDI_RXDATA_SOF_ONLY:    // 1
            /* fragment start */
            // debug_printf("[ETH] (SOF)Don't use fragment yet...\r\n");
            break; //return;
        case CEDI_RXDATA_NO_FLAG:     // 2
            /* fragment */
            // debug_printf("[ETH] (NOF)Don't use fragment yet...\r\n");
            break; //return;
        case CEDI_RXDATA_EOF_ONLY:    // 3
            /* fragment end */
            // debug_printf("[ETH] (EOF)Don't use fragment yet...\r\n");
            break;
        case CEDI_RXDATA_NODATA:      // 4
            /* normal leaving */
            // debug_printf("[ETH] NG5 RXDATA_NODATA\r\n");
            noData = true;
            break;
        default:
            /* Unknown status */
            break;
        }
        if (noData)
        {
            break;/* from here it breaks while loop   */
        }
        u32RxNum--;
    }
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventRxError
****************************************************************************//**
*
* \brief Function called by cadence driver upon getting Rx Error Event
*
* \param pcy_privatedata    Instance specific private data
* \param u32event occurred event
* \param u8qnum Queue number
*
*******************************************************************************/
static void Cy_ETHIF_EventRxError(void *pcy_privatedata, uint32_t a_event, uint8_t a_qnum)
{
    //printf("[ETH] (Event) RxError received.\r\n");
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(a_event); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(a_qnum); /* Suppress a compiler warning about unused variables */

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventPhyManComplete
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventPhyManComplete(void *pcy_privatedata, uint8_t u8read, uint16_t u16ReadData)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(u8read); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(u16ReadData); /* Suppress a compiler warning about unused variables */

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventhrespError
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventhrespError(void *pcy_privatedata, uint8_t u8qnum)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(u8qnum); /* Suppress a compiler warning about unused variables */

    return;
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventLpPageRx
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventLpPageRx(void* pcy_privatedata, struct CEDI_LpPageRx* pageRx)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(pageRx); /* Suppress a compiler warning about unused variables */
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventAn
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventAn(void* pcy_privatedata, struct CEDI_NetAnStatus* netStat)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(netStat); /* Suppress a compiler warning about unused variables */
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventLinkChange
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventLinkChange(void *pcy_privatedata, uint8_t a_linkstate)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(a_linkstate); /* Suppress a compiler warning about unused variables */

    return;
}
/*******************************************************************************
* Function Name: Cy_ETHIF_EventTsu
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventTsu(void *pcy_privatedata, uint32_t u32event)
{
    uint8_t u8EthIfInstance = 255;
    ETH_Type *base = NULL;

    /* derive the instance */
    u8EthIfInstance = Cy_ETHIF_GetEthIfInstance(pcy_privatedata);

    base = CY_ETHIF_IP_ADDR_REGBASE(u8EthIfInstance);

    /* Event generated if second count of the timer has incremented */
    if (0UL != (u32event & ((uint32_t)CEDI_EV_TSU_SEC_INC)))
    {
        /* application callback function     */
        if (stccallbackfunctions[u8EthIfInstance].tsuSecondInccb != NULL)
        {
            stccallbackfunctions[u8EthIfInstance].tsuSecondInccb(base);
        }
    }
}
/*******************************************************************************
* Function Name: Cy_ETHIF_EventPauseFrame
****************************************************************************//**
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventPauseFrame(void *pcy_privatedata, uint32_t u32event)
{
    if (0UL != (u32event & ((uint32_t)CEDI_EV_PAUSE_FRAME_TX)))
    {
        // debug_printf("Pause frame transmitted");
    }

    if (0UL != (u32event & ((uint32_t)CEDI_EV_PAUSE_NZ_QU_RX)))
    {
        // debug_printf("Pause frame received");
    }
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
}
/*******************************************************************************
* Function Name: Cy_ETHIF_EventPtp
********************************************************************************
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventPtp(void* pcy_privatedata, uint32_t u32type, struct CEDI_1588TimerVal* time)
{
    if (0UL != (u32type & ((uint32_t)CEDI_EV_PTP_TX_SYNC)))
    {
        // printf("Sync frame transmitted");
    }

    if (0UL != (u32type & ((uint32_t)CEDI_EV_PTP_TX_PDLY_REQ)))
    {
        // printf("PTP PDelay Req frame transmitted");
    }

    if (0UL != (u32type & ((uint32_t)CEDI_EV_PTP_TX_PDLY_RSP)))
    {
        // printf("PTP PDelay Resp frame transmitted");
    }

    if (0UL != (u32type & ((uint32_t)CEDI_EV_PTP_RX_SYNC)))
    {
        // printf("Sync frame received");
    }

    if (0UL != (u32type & ((uint32_t)CEDI_EV_PTP_RX_PDLY_REQ)))
    {
        // printf("PTP PDelay Req frame received");
    }

