PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_ethif.c
    if (0UL != (u32type & ((uint32_t)CEDI_EV_PTP_RX_PDLY_RSP)))
    {
        // printf("PTP PDelay Resp frame received");
    }
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(time); /* Suppress a compiler warning about unused variables */
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventExternalInt
********************************************************************************
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventExternalInt(void * pcy_privatedata)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
}

/*******************************************************************************
* Function Name: Cy_ETHIF_EventWol
********************************************************************************
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventWol(void * pcy_privatedata)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
}
/*******************************************************************************
* Function Name: Cy_ETHIF_EventLpi
********************************************************************************
*
* \brief
*
* \param
*
*
*******************************************************************************/
static void Cy_ETHIF_EventLpi(void * pcy_privatedata)
{
    CY_UNUSED_PARAMETER(pcy_privatedata); /* Suppress a compiler warning about unused variables */
}


static cy_en_syspm_status_t Cy_ETHIF_DSCallbackFunc(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    CY_UNUSED_PARAMETER(callbackParams);

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        retVal = CY_SYSPM_SUCCESS;
    }
    break;
    case CY_SYSPM_CHECK_FAIL:
    {
        retVal = CY_SYSPM_SUCCESS;
    }
    break;
    case CY_SYSPM_BEFORE_TRANSITION:
    {
        uint8_t u8EthIfInstance, u8tmpcounter;
        ETH_Type *base;

        base = (ETH_Type *)callbackParams->base;
        if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
        {
            return CY_SYSPM_BAD_PARAM;
        }

        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);

        (void)cyp_ethif_gemgxlobj->getCopyAllFrames((void *)cyp_ethif_pd[u8EthIfInstance], &(g_ds_regs[u8EthIfInstance].copy_all_frames));
        (void)cyp_ethif_gemgxlobj->getNoBroadcast((void *)cyp_ethif_pd[u8EthIfInstance], &(g_ds_regs[u8EthIfInstance].no_broadcast));

        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 1, 'Intentional typecast of &config->filterAddr to CEDI_MacAddress* struct type.')
        (void)emacGetSpecificAddr((void *)cyp_ethif_pd[u8EthIfInstance],
                                  (uint8_t)CY_ETHIF_FILTER_NUM_1,
                                  (CEDI_MacAddress*) & (g_ds_regs[u8EthIfInstance].fileter1Config.filterAddr),
                                  (uint8_t *) & (g_ds_regs[u8EthIfInstance].fileter1Config.typeFilter),
                                  (uint8_t *) & (g_ds_regs[u8EthIfInstance].fileter1Config.ignoreBytes));
        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')

        for (u8tmpcounter = 0; u8tmpcounter < cy_ethif_cfg[u8EthIfInstance].rxQs; u8tmpcounter++)
        {
            (void)emacNumRxBufs((void *)cyp_ethif_pd[u8EthIfInstance], 0, g_ds_regs[u8EthIfInstance].ptrRxBufs[u8tmpcounter]);
        }
        retVal = CY_SYSPM_SUCCESS;
    }
    break;
    case CY_SYSPM_AFTER_TRANSITION:
    {
        uint32_t u32RetValue;
        uint8_t u8EthIfInstance;
        uint8_t u8tmpcounter = 0, u8tmpintrcntr = 0;
        CEDI_BuffAddr rx_buff_addr;
        ETH_Type *base;

        base = (ETH_Type *)callbackParams->base;

        /* check for arguments */
        if (!CY_ETHIF_IS_IP_INSTANCE_VALID(base))
        {
            retVal = CY_SYSPM_BAD_PARAM;
            break;
        }

        u8EthIfInstance = CY_ETHIF_IP_INSTANCE(base);
        /* Restore registers */
        /* Enable the IP to access EMAC registers set */
        Cy_ETHIF_IPEnable(base);

        /* Initialization EMAC registers */
        u32RetValue = cyp_ethif_gemgxlobj->init((void *)cyp_ethif_pd[u8EthIfInstance], &cy_ethif_cfg[u8EthIfInstance], &Cy_ETHIF_Callbacks);
        if (u32RetValue == ((uint32_t)EINVAL) || u32RetValue == ((uint32_t)ENOTSUP))
        {
            Cy_ETHIF_IPDisable(base);
            retVal = CY_SYSPM_BAD_PARAM;
            break;
        }

        for (u8tmpcounter = 0; u8tmpcounter < cy_ethif_cfg[u8EthIfInstance].rxQs; u8tmpcounter++)
        {
            if (g_pRxQbuffPool[u8EthIfInstance][u8tmpcounter] != NULL)
            {
                for (u8tmpintrcntr = 0; u8tmpintrcntr < cy_ethif_cfg[u8EthIfInstance].rxQLen[u8tmpcounter]; u8tmpintrcntr++)
                {
                    rx_buff_addr.vAddr = (uintptr_t)((*g_pRxQbuffPool[u8EthIfInstance])[u8tmpcounter][u8tmpintrcntr]);
                    rx_buff_addr.pAddr = rx_buff_addr.vAddr;
                    (void)cyp_ethif_gemgxlobj->addRxBuf((void *)cyp_ethif_pd[u8EthIfInstance],
                                                        u8tmpcounter,
                                                        (CEDI_BuffAddr *)&rx_buff_addr,
                                                        0);
                }
            }
        }


        /* additional Receive configurations */
        cyp_ethif_gemgxlobj->setCopyAllFrames((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);
        cyp_ethif_gemgxlobj->setRxBadPreamble((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);

        /* Do not drop frames with CRC error */
        cyp_ethif_gemgxlobj->setIgnoreFcsRx((void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);

        /* Enable MDIO */
        cyp_ethif_gemgxlobj->setMdioEnable((void *)(void *)cyp_ethif_pd[u8EthIfInstance], CY_ETH_ENABLE_1);

        /* driver start */
        cyp_ethif_gemgxlobj->start((void *)cyp_ethif_pd[u8EthIfInstance]);


        /* set config reg */
        cyp_ethif_gemgxlobj->setCopyAllFrames((void *)cyp_ethif_pd[u8EthIfInstance], g_ds_regs[u8EthIfInstance].copy_all_frames);

        /* Reject Broad cast frames */
        cyp_ethif_gemgxlobj->setNoBroadcast((void *)cyp_ethif_pd[u8EthIfInstance], g_ds_regs[u8EthIfInstance].no_broadcast);

        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 1, 'Intentional typecast of &config->filterAddr to CEDI_MacAddress* struct type.')
        /* Apply filter */
        (void)cyp_ethif_gemgxlobj->setSpecificAddr((void *)cyp_ethif_pd[u8EthIfInstance],
                CY_ETHIF_FILTER_NUM_1,
                (CEDI_MacAddress*) & (g_ds_regs[u8EthIfInstance].fileter1Config.filterAddr),
                g_ds_regs[u8EthIfInstance].fileter1Config.typeFilter,
                g_ds_regs[u8EthIfInstance].fileter1Config.ignoreBytes);
        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')

        retVal = CY_SYSPM_SUCCESS;
    }
    break;
    default:
        /* default case */
        break;
    }

    return retVal;
}


CY_MISRA_BLOCK_END('MISRA C-2012 Rule 18.1')
CY_MISRA_BLOCK_END('OVERRUN')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXETH */
/* [] END OF FILE */
